In [1]:
# getting rows (df['rows'], df.index, loc, iloc, at, iat)
# changing index
# adding row
# resetting index
# changing index name
# rename index label
# dropping index
# dropping rows
# boolean selection
# adding and removing duplicates

# Task - Create a bank_name, ifsc, account_holder, amount

In [2]:
import pandas as pd
import numpy as np

In [3]:
np.random.seed(42)

bank_data = {
    'BankName': ['HDFC', 'ICICI', 'AXIS', 'CUB'],
    'IFSC': np.random.randint(120001000, 120002000, 4),
    'AccountHolder': ['Ram', 'Teja', 'Sam', 'Mohan'],
    'Amount': [12000,85000,5000,46000]
}

In [4]:
df = pd.DataFrame(bank_data)

In [5]:
df

  BankName       IFSC AccountHolder  Amount
0     HDFC  120001102           Ram   12000
1    ICICI  120001435          Teja   85000
2     AXIS  120001860           Sam    5000
3      CUB  120001270         Mohan   46000

In [6]:
# getting rows (df['rows'], df.index, loc, iloc, at, iat)

print(df['IFSC'],'\n')
print(df.index, '\n')
print(list(df.index), '\n')
print(df.loc[1:2, 'IFSC':], '\n')
print(df.iloc[2:,2:], '\n')
print(df.at[1, 'AccountHolder'],'\n')
print(df.iat[2,1])

0    120001102
1    120001435
2    120001860
3    120001270
Name: IFSC, dtype: int32

RangeIndex(start=0, stop=4, step=1)

[0, 1, 2, 3]

        IFSC AccountHolder  Amount
1  120001435          Teja   85000
2  120001860           Sam    5000

  AccountHolder  Amount
2           Sam    5000
3         Mohan   46000

Teja

120001860

In [11]:
# changing index
df.index.name

'Emp_id'

In [13]:
print(df.columns)

Index(['BankName', 'IFSC', 'AccountHolder', 'Amount'], dtype='object')

In [14]:
df.set_index('AccountHolder', inplace=True)

In [18]:
# rename index label

df = df.rename_axis('Emp_name')

In [19]:
df

         BankName       IFSC  Amount
Emp_name
Ram          HDFC  120001102   12000
Teja        ICICI  120001435   85000
Sam          AXIS  120001860    5000
Mohan         CUB  120001270   46000

In [20]:
# dropping index

df.reset_index(drop=True, inplace=True)

In [21]:
df

  BankName       IFSC  Amount
0     HDFC  120001102   12000
1    ICICI  120001435   85000
2     AXIS  120001860    5000
3      CUB  120001270   46000

In [22]:
# dropping rows

df.drop([1,3], axis = 0)

  BankName       IFSC  Amount
0     HDFC  120001102   12000
2     AXIS  120001860    5000

In [25]:
# boolean selection

df[df['Amount']> 35000]

  BankName       IFSC  Amount
1    ICICI  120001435   85000
3      CUB  120001270   46000

In [32]:
# adding and removing duplicates

df_duplicate = pd.concat([df, df.iloc[0]], ignore_index=True)

In [33]:
df_duplicate

  BankName         IFSC   Amount          0
0     HDFC  120001102.0  12000.0        NaN
1    ICICI  120001435.0  85000.0        NaN
2     AXIS  120001860.0   5000.0        NaN
3      CUB  120001270.0  46000.0        NaN
4      NaN          NaN      NaN       HDFC
5      NaN          NaN      NaN  120001102
6      NaN          NaN      NaN      12000

In [34]:
df.drop_duplicates()

  BankName       IFSC  Amount
0     HDFC  120001102   12000
1    ICICI  120001435   85000
2     AXIS  120001860    5000
3      CUB  120001270   46000